app/controllers/exports_controller.rb

  def index
    @exports = Export.order(created_at: :desc)
---
SELECT "exports".* FROM "exports" ORDER BY "exports"."created_at" DESC

  def show
    @export = Export.find(params[:id])
---
SELECT "exports".* FROM "exports" WHERE "exports"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

  def create
    mr_url = params[:mr_url]

    unless mr_url
      flash[:error] = 'MR URL is required'
      return redirect_to new_export_path
    end

    service = GitlabService.new
    result = service.export_merge_request_feedback(mr_url)

    @export = Export.create!(
      mr_url: mr_url,
      mr_iid: result[:mr_iid],
      project_path: result[:project_path],
      mr_title: result[:merge_request][:title],
      mr_author: result[:merge_request][:author],
      mr_state: result[:merge_request][:state],
      data: result
    )

    # Auto-mark feedback with check marks as reviewed
    result[:feedback].each do |feedback|
      if feedback[:has_check_mark]
        @export.feedbacks.create(feedback_id: feedback[:id].to_s, reviewed: true)
---
INSERT INTO "exports" ("mr_url", "mr_iid", "project_path", "mr_title", "mr_author", "mr_state", "data", "created_at", "updated_at", "reviewed") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
INSERT INTO "feedbacks" ("export_id", "feedback_id", "reviewed", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["export_id", 7], ["feedback_id", "59110"], ["reviewed", true], ["created_at", "2025-11-06 15:20:38.944882"], ["updated_at", "2025-11-06 15:20:38.944882"]]