app/controllers/feedbacks_controller.rb

SELECT "exports".* FROM "exports" WHERE "exports"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT "feedbacks".* FROM "feedbacks" WHERE "feedbacks"."export_id" = $1 AND "feedbacks"."feedback_id" = $2 LIMIT $3  [["export_id", 5], ["feedback_id", "59109"], ["LIMIT", 1]]
INSERT INTO "feedbacks" ("export_id", "feedback_id", "reviewed", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["export_id", 5], ["feedback_id", "59109"], ["reviewed", false], ["created_at", "2025-11-06 11:53:13.863493"], ["updated_at", "2025-11-06 11:53:13.863493"]]
UPDATE "feedbacks" SET "reviewed" = $1, "updated_at" = $2 WHERE "feedbacks"."id" = $3  [["reviewed", true], ["updated_at", "2025-11-06 11:53:13.882563"], ["id", 1]]
---
  def mark_reviewed
    export = Export.find(params[:export_id])
    feedback_item = export.data['feedback'].find { |f| f['id'].to_s == params[:id] }

    unless feedback_item
      return respond_to do |format|
        format.html { redirect_to export_path(export), alert: 'Feedback not found' }
        format.json { render json: { error: 'Feedback not found' }, status: :not_found }
      end
    end

    feedback = export.feedbacks.find_or_create_by(feedback_id: params[:id])
    feedback.update!(reviewed: true)