app/views/exports/show.html.erb

SELECT "feedbacks"."feedback_id" FROM "feedbacks" WHERE "feedbacks"."export_id" = $1 AND "feedbacks"."reviewed" = $2  [["export_id", 5], ["reviewed", true]]
---
<% feedback = @export.data.dig('feedback') || [] %>
<% reviewed_ids = @export.feedbacks.reviewed.pluck(:feedback_id) %>